Tekla Open API Reference for Tekla Structures 2025
RebarSpacingZone.LengthEnum Enumeration
 The length type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LengthEnum
Public Enumeration LengthEnum
Members
Member name | Value | Description
ABSOLUTE | 0 |  The length is an absolute value.
RELATIVE | 1 |  The length is a relative value.
See Also
Reference
Tekla.Structures.Model Namespace